const departments = [
  { id: "a-1", name: "Фортепіано", photo:'https://i.ibb.co/QYzYNWg/pexels-cottonbro-studio-5650529.jpg', about:"Гра на фортепіано - це захоплива подорож для дітей у світ музики та можливість виявити свій музичний потенціал та розвинути творчі здібності. Цей чудовий інструмент надає можливість дітям виразити свої почуття та емоції через музику, розвиваючи в них музичний слух і вміння читати ноти. Гра на фортепіано також сприяє поліпшенню координації рук, розвитку концентрації та терпіння. Безсумнівно, цей інструмент відкриває двері до неймовірного світу музики, який зачаровує та надихає юних музикантів."},
  { id: "a-2", name: "Струнно-смичкові інструменти", photo:'https://i.ibb.co/jrbbY7z/pexels-pixabay-210854.jpg', about:"Гра на струнно-смичкових інструментах - це захоплюючий світ, який дає дітям відкрити в собі музичну магію. Вони зможуть відчути власні обрані ноти, створюючи чарівні мелодії, що сповнені почуттями та виразністю. Гра на скрипці, віолончелі або альту розвиває в дітях вміння слухати, концентруватися і сприяє виробленню гармонійного почуття ритму. Крім того, ці інструменти навчають відповідальності, адже для досягнення високих результатів потрібно вкладати час та наполегливість. Грати на струнно-смичкових інструментах - це завжди цікаво та вдячно, адже вони дарують можливість створювати чарівну музику." },
  { id: "a-3", name: "Духові інструменти", photo:'https://i.ibb.co/RNtNjTy/pexels-teddy-yang-2254140.jpg', about:'Гра на духових інструментах - це неймовірна пригода для дітей, яка запрошує у музичний світ. Вони зможуть відчути себе справжніми музикантами, навчившись грати на трубі, саксофоні, флейті та інших інструментах. Ця діяльність сприяє розвитку дихальної системи та допомагає покращити контроль над диханням. Гра на духових інструментах також вчить дітей спілкуватися мовою музики та виражати свої почуття через звуки. Вона робить музику доступною і захоплюючою, а також допомагає формувати вміння слухати та сприймати мелодію. Це чудовий спосіб для дітей виразити свою індивідуальність та розкрити свій творчий потенціал.'},
  { id: "a-4", name: "Ударні інструменти", photo:'https://i.ibb.co/XJKYNGg/pexels-josh-sorenson-995301.jpg', about:'Гра на ударних інструментах - це особливий спосіб виплеснути свою енергію. Діти зможуть віднайти у собі справжнього ударника, навчившись грати на барабанах, ксилофоні, дзвіночках і багатьох інших інструментах. Гра на ударних інструментах розвиває координацію рук та розвиток моторики, а також допомагає дітям вчитися працювати в команді та слухати одне одного у музичному виконанні. Це чудовий спосіб для дітей виразити свої почуття через ритм і створити музику власноруч. Ударні інструменти роблять музику неймовірно захопливою і доступною для маленьких музикантів.' },
  { id: "a-5", name: "Народні інструменти", photo:'https://i.ibb.co/3FLhwtw/pexels-pixabay-33597.jpg', about:"Народні інструменти, такі як гітара, бандура, баян та інші, відкривають дітям чарівний світ музики, насичений культурними традиціями. Граючи на цих інструментах, діти пізнають багатство своєї спадщини і вчаться виконувати мелодії, які були передані з покоління в покоління. Народні інструменти допомагають зберігати і популяризувати унікальні музичні традиції та вчать дітей цінувати різноманіття культур. Завдяки навчанню на народних інструментах, діти можуть долучитися до світу української, а також інших національних музичних мистецтв та стати частиною неперевершеної музичної спадщини." },
  { id: "a-6", name: "Вокал", photo:'https://i.ibb.co/7n0qgsY/pexels-dmitry-demidov-3783471.jpg', about:"Вокальне мистецтво - це дивовижний світ виразності та музичної гармонії. У нашій музичній школі, діти отримають можливість розкрити свій вокальний талант під керівництвом досвідчених викладачів. Ми пропонуємо індивідуальні та групові заняття вокалом, де діти вивчають основи вокальної техніки, розвивають свій голос, та вчаться виконувати улюблені пісні. Вокальне навчання розширює музичний горизонт дітей і дарує їм можливість виразити свої почуття та емоції через музику." },
  { id: "a-7", name: "Музично - теоретичний відділ", photo:'https://i.ibb.co/Qrsrzc2/bg.jpg', about:"Музично-теоретичний відділ нашої школи є важливою складовою частиною музичної освіти для дітей. Тут діти здобувають теоретичні знання, які є основою для розуміння музики. Вони вивчають музичну нотацію, ритміку, гармонію, історію музики та багато іншого. Навички, отримані в музично-теоретичному відділі, допомагають дітям краще розуміти та виконувати музику на своїх інструментах або вокально. Відкривши для себе музичну теорію, діти розкривають перед собою безмежні можливості у музичному світі." }
];

export const getDepartments = () => {
  return departments;
};

export const getDepartmentById = (departmentId) => {
  return departments.find((department) => department.id === departmentId);
};

const bands = [
  { id: "q-1", name: "Оркестр народної музики 'Барвисті Візерунки'", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-2", name: "Фортепіанний дует 'Но-Та'", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-3", name: "Дитячий хор", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-4", name: "Ансамбль скрипалів", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-5", name: "Ансамбль флейтистів", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-6", name: "Вокальний дует", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-7", name: "Фольклорний ансамбль", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' },
  { id: "q-8", name: "Ансамбль гітаристів", photo:'./src/assets/img/pexels-dmitry-demidov-3783471.jpg' }
];

export const getBands = () => {
  return bands;
};

export const getBandById = (bandId) => {
  return bands.find((band) => band.id === bandId);
};