// import { Image } from "./Home.styled";

import { MainSection, TitleComponent } from "./Home.styled";

export const Home = () => {
  return (
    <MainSection>
      <TitleComponent>Жити без музики — це, як дихати без повітря</TitleComponent>
      {/* <Image src="https://via.placeholder.com/960x240"/> */}
      {/* <p>
        Для мешканців Святошинського району працює з 1971 року.
        Школа є державним позашкільним навчальним закладом освіти в галузі
        культури, здійснює естетичне виховання дітей, учнів, громадян, забезпечуючи принцип
        єдності і наступності мистецької освіти; проводить навчально-виховну, методичну,
        просвітницьку роботу.
Навчання здійснюється за 16-ма спеціальностями: фортепіано, баян, акордеон, гітара, домра, бандура, скрипка, саксофон, кларнет, флейта, труба, сопілка, най, ударні інструменти, сольний спів (академічний, естрадний);
Для громадян віком від 18 років працює група естетичного виховання на засадах самоокупності;
В школі створені чудові колективи: хор молодших і старших класів; ансамбль скрипалів «Унісон»; ансамблі: бандуристок «Кольорова пісня», гітаристів «Алегріас», акордеоністів «Імпресія», домристів «Пролісок», барабанщиків та ансамбль народної музики «Барвисті візерунки»;
З дня заснування школу закінчили біля 2000 учнів, 385 випускників продовжили освіту у вищих навчальних закладах мистецького спрямування, 56 з них обрали музику своєю спеціальністю, 25 колишніх випускників працюють в ДМШ викладачами.
Учні та викладачі мають численні нагороди лауреатів Всеукраїнських та Міжнародних фестивалів-конкурсів як в Україні, так і в Білорусії, Болгарії, Чехії, Угорщині, Чорногорії; виступають з концертами в Переяслав-Хмельницькому, Корсунь-Шевченківському, Рівному, Львові, Бердянську, Москві, Нижньому-Новгороді, Санкт-Петербурзі; постійно беруть участь в концертах районної та Київської дитячої філармонії, в концертних програмах телеканалів «Інтер», «Київ», «Культура», УТ-1, СТБ, «Рада».
Навчання в школі дає змогу учням задовольнити потребу в творчому, інтелектуальному, духовному розвитку, в професійному самовизначенні, відкрити для себе величний і прекрасний світ музики.
      </p> */}
    </MainSection>
  );
};
