import { MainText, MainTitle, SectionComponent } from "./Home.styled";

export const Mission = () => {
  return (
    <SectionComponent>
      <MainTitle>Наша мета</MainTitle>
      <MainText>
        Запрошуємо всіх бажаючих долучитися до нашої Дитячої музичної школи №22 і
        дозволити нашим викладачам розкрити вашому малюкові потенціал у музичному світі.
        Ви можете звязатися з нами за телефоном або електронною поштою, щоб отримати додаткову
        інформацію та записати свою дитину на пробне заняття. Ми відкриті для кожного,
        хто хоче розвивати свої музичні здібності та отримати незабутні враження від навчання у нашій школі!
      </MainText>
    </SectionComponent>
  );
};
