import { CardManage } from "../UI/CardManagement/CardManage.jsx";
import { MainText, MainTitle, SectionComponent } from "./Home.styled";
export const Mission = () => {
  
  return (
    <SectionComponent>
      <MainTitle>Керівний склад</MainTitle>
      <MainText>
        <article>
           <p>Сьогодні КДМШ №22 - мистецький заклад, творчий колектив якого, на чолі з директором Любов'ю Василівною Герасимчук (яка очолює школу з 1999 року, до цього з 1978 року - була заступником директора з навчальної роботи) та заступниками директора Філоненко Світланою Леонідівною (яка замінила на посаді заступника директора з навчальної роботи Уманець Олену Миколаївну у 2019 році) та Снігур Олександрою Олегівною (яка на посаді заступника директора з виховної роботи у 2019 році замінила Лисенко Юлію Валеріївну) по праву займає достойне місце серед мистецьких навчальних закладів міста.</p>
        </article>
      
      </MainText>
      <CardManage/>
    </SectionComponent>
  );
};
