import { MainText, SectionComponent } from "./Home.styled";

export const School = () => {
  return (
    <SectionComponent>
      <MainText>
                Для мешканців Святошинського району працює з 1971 року.
        Школа є державним позашкільним навчальним закладом освіти в галузі
        культури, здійснює естетичне виховання дітей, учнів, громадян, забезпечуючи принцип
        єдності і наступності мистецької освіти; проводить навчально-виховну, методичну,
        просвітницьку роботу.

      </MainText>
    </SectionComponent>
  );
};